Revit 2027 API
FillPatternTarget Enumeration
 The type of the fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FillPatternTarget
Public Enumeration FillPatternTarget
public enum class FillPatternTarget
type FillPatternTarget
Members
Member name | Value | Description
Drafting | 0 |  Represents a material in symbolic form.
Model | 1 |  Represents an actual element appearance on a building.
None | 2
See Also
Reference
Autodesk.Revit.DB Namespace